#02testprint.py

# 변수 하나씩 선언, 다중선언


msg = 97234
print('{}'.format(msg))         #97234
print('{:>10,}'.format(msg))    #    97,234          총10자릿수 오른쪽맞춤
print('{:<10,}'.format(msg))    #97,234          총10자릿수 오른쪽맞춤
print('{:^10,}'.format(msg))    #  97,234          총10자릿수 중앙맞춤

print()
print('-'*100)         # '*' 이때 *은 문자열반복      ->  ---------------------------------------------------------------------------------------------------- 로 출력













'''

#print(변수, '문자', ~~ )
print(a, '*', b, '=', ret)

#print( '%d 정수 , %s 문자열 ,%f 실수 ,%c 문자' )
print('%d * %d = %d' %(a,b,ret))


#print(' f{변수및값}' )
print(f'{a} * {b} = {ret}')

print()

'''

